# StairsSupporttypeStructuralDepthOnRun Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupporttypeStructuralDepthOnRun Property
ParameterTypeId Class See Also
---
"Structural Depth On Run": Structural Depth
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupporttypeStructuralDepthOnRun { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupporttypeStructuralDepthOnRun As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupporttypeStructuralDepthOnRun {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace